## Plan Result (ithc_backendappgateway)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.backendappgateway.azurerm_role_assignment.certificates_access
* Update
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw|app-gw-storage-account"
        name               = "app-gw-storage-account"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw|app-gw-storage-account"
        name               = "app-gw-storage-account"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_role_assignment.certificates_access will be created
  + resource "azurerm_role_assignment" "certificates_access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6b683e76-533b-4129-9469-3cfffeb2fbb0"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-platform-ithc-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsithc"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1863,"Program":"tfcmt","SHA1":"","Target":"ithc_backendappgateway","Vars":{}} -->